namespace Domain.Enums;

public enum CurrencyCode
{
    None = 0,        // Значение по умолчанию
    USD = 1,         // Доллар США
    RUB = 2,         // Российский рубль
    TJS = 3,         // Таджикский сомони
    EUR = 4,         // Евро
    CNY = 5,         // Китайский юань
    JPY = 6,         // Японская иена
    INR = 7,         // Индийская рупия
    GBP = 8,         // Британский фунт
    AUD = 9,         // Австралийский доллар
    CAD = 10,        // Канадский доллар
    CHF = 11,        // Швейцарский франк
    NZD = 12,        // Новозеландский доллар
    SEK = 13,        // Шведская крона
    NOK = 14,        // Норвежская крона
    DKK = 15,        // Датская крона
    PLN = 16,        // Польский злотый
    CZK = 17,        // Чешская крона
    HUF = 18,        // Венгерский форинт
    ZAR = 19,        // Южноафриканский ранд
    TRY = 20,        // Турецкая лира
    SAR = 21,        // Саудовский риал
    AED = 22,        // Дирхам ОАЭ
    SGD = 23,        // Сингапурский доллар
    HKD = 24,        // Гонконгский доллар
    KRW = 25,        // Южнокорейская вона
    THB = 26,        // Таиландский бат
    MYR = 27,        // Малайзийский ринггит
    IDR = 28,        // Индонезийская рупия
    PHP = 29,        // Филиппинское песо
    BRL = 30,        // Бразильский реал
    ARS = 31,        // Аргентинский песо
    MXN = 32,        // Мексиканское песо
    VND = 33,        // Вьетнамский донг
    EGP = 34,        // Египетский фунт
    NGN = 35         // Нигерийская найра
    // Добавьте остальные валюты, если необходимо
}