namespace Domain.Enums;

public enum PhoneCode
{
    None = 0, // Значение по умолчанию
    US = 1, // +1: Соединенные Штаты
    CA = 1, // +1: Канада
    RU = 7, // +7: Россия
    KZ = 7, // +7: Казахстан
    TJ = 992, // +992: Таджикистан
    DE = 49, // +49: Германия
    FR = 33, // +33: Франция
    IT = 39, // +39: Италия
    CN = 86, // +86: Китай
    IN = 91, // +91: Индия
    JP = 81, // +81: Япония
    GB = 44, // +44: Великобритания
    AU = 61, // +61: Австралия
    NZ = 64, // +64: Новая Зеландия
    ZA = 27, // +27: Южная Африка
    EG = 20, // +20: Египет
    BR = 55, // +55: Бразилия
    AR = 54, // +54: Аргентина
    MX = 52, // +52: Мексика
    ES = 34, // +34: Испания
    SE = 46, // +46: Швеция
    NO = 47, // +47: Норвегия
    DK = 45, // +45: Дания
    FI = 358, // +358: Финляндия
    TR = 90, // +90: Турция
    SA = 966, // +966: Саудовская Аравия
    IR = 98, // +98: Иран
    PK = 92, // +92: Пакистан
    ID = 62, // +62: Индонезия
    NG = 234, // +234: Нигерия
    KE = 254, // +254: Кения
    ET = 251, // +251: Эфиопия
    UA = 380, // +380: Украина
    PL = 48, // +48: Польша
    GR = 30, // +30: Греция
    NL = 31, // +31: Нидерланды
    BE = 32, // +32: Бельгия
    PT = 351, // +351: Португалия
    CH = 41, // +41: Швейцария
    AT = 43, // +43: Австрия
    HU = 36, // +36: Венгрия
    CZ = 420, // +420: Чехия
    SK = 421, // +421: Словакия
    KR = 82, // +82: Южная Корея
    TH = 66, // +66: Таиланд
    VN = 84, // +84: Вьетнам
    MY = 60, // +60: Малайзия
    SG = 65, // +65: Сингапур
    PH = 63, // +63: Филиппины
}